<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        // \App\Models\User::factory(10)->create();

        // \App\Models\User::factory()->create([
        //     'name' => 'Test User',
        //     'email' => 'test@example.com',
        // ]);

        DB::table('categories')->insert([
            [
                'name' => '農業',
            ],
            [
                'name' => '林業',
            ],
            [
                'name' => '漁業・水産養殖業',
            ],
            [
                'name' => '鉱業・採石業・砂利採取業',
            ],
            [
                'name' => '建設業',
            ],
            [
                'name' => '食料品製造業',
            ],
            [
                'name' => '飲料製造業',
            ],
            [
                'name' => 'たばこ製造業',
            ],
            [
                'name' => '飼料・有機質肥料製造業',
            ],
            [
                'name' => '製糸業、紡績業、化学繊維・ねん糸等製造業',
            ],
            [
                'name' => '織物業、ニット生地製造業',
            ],
            [
                'name' => '染色整理業、綱・網・レース・繊維粗製品製造業',
            ],
            [
                'name' => '衣服、その他の繊維製品製造業',
            ],
            [
                'name' => '木材・木製品製造業',
            ],
            [
                'name' => 'パルプ・紙製造業',
            ],
            [
                'name' => '紙加工品製造業',
            ],
            [
                'name' => '化学肥料製造業',
            ],
            [
                'name' => '無機化学工業製品製造業',
            ],
            [
                'name' => '有機化学工業製品製造業',
            ],
            [
                'name' => '油脂加工製品・石けん・合成洗剤・界面活性剤・塗料製造業',
            ],
            [
                'name' => '医薬品製造業',
            ],
            [
                'name' => '化粧品・歯磨、その他の化粧用調整品製造業',
            ],
            [
                'name' => 'その他の化学工業',
            ],
            [
                'name' => '石油精製業,'
            ],
            [
                'name' => 'その他の石油製品・石炭製品製造業',
            ],
            [
                'name' => 'ガラス・同製品製造業',
            ],
            [
                'name' => 'セメント・同製品製造業',
            ],
            [
                'name' => 'その他の窯業・土石製品製造業',
            ],
            [
                'name' => '銑鉄・粗鋼・鋼材製造業',
            ],
            [
                'name' => '鋳鍛造品・その他の鉄鋼製品製造業',
            ],
            [
                'name' => '非鉄金属製錬・精製業',
            ],
            [
                'name' => 'その他の非鉄金属製品製造業',
            ],
            [
                'name' => '建設用・建築用金属製品製造業',
            ],
            [
                'name' => 'その他の金属製品製造業',
            ],
            [
                'name' => '一般産業用機械・装置製造業',
            ],
            [
                'name' => 'その他のはん用機械器具製造業',
            ],
            [
                'name' => '農業用機械、建設機械・鉱山機械、繊維機械製造業',
            ],
            [
                'name' => '生活関連産業用機械・基礎素材産業用機械製造業',
            ],
            [
                'name' => '金属加工機械製造業',
            ],
            [
                'name' => '半導体・フラットパネルディスプレイ製造装置製造業',
            ],
            [
                'name' => 'その他の生産用機械器具製造業',
            ],
            [
                'name' => '事務用・サービス用・娯楽用機械器具製造業',
            ],
            [
                'name' => '光学機械器具・レンズ製造業',
            ],
            [
                'name' => 'その他の業務用機械器具製造業',
            ],
            [
                'name' => '産業用電気機械器具製造業',
            ],
            [
                'name' => '民生用電気機械器具製造業',
            ],
            [
                'name' => '電子応用装置製造業',
            ],
            [
                'name' => 'その他の電気機械器具製造業',
            ],
            [
                'name' => '通信機械器具・同関連機械器具、映像・音響機械器具製造業',
            ],
            [
                'name' => '電子計算機・同付属装置製造業',
            ],
            [
                'name' => '電子部品・デバイス・電子回路製造業',
            ],
            [
                'name' => '自動車、自動車車体・付随車製造業',
            ],
            [
                'name' => '自動車部分品・付属品製造業',
            ],
            [
                'name' => 'その他の輸送用機械器具製造業',
            ],
            [
                'name' => '家具・装備品製造業',
            ],
            [
                'name' => '印刷・同関連業',
            ],
            [
                'name' => 'プラスチック製品製造業',
            ],
            [
                'name'=> 'ゴム製品製造業',
            ],
            [
                'name' => 'なめし革・同製品・毛皮製造業',
            ],
            [
                'name' => 'その他の製造業',
            ],
            [
                'name' => '電気業、ガス業、熱供給業、水道業',
            ],
            [
                'name' => '通信業',
            ],
            [
                'name' => '放送業',
            ],
            [
                'name' => '情報サービス業',
            ],
            [
                'name' => 'インターネット附随サービス業',
            ],
            [
                'name' => '映像・音声・文字情報制作業',
            ],
            [
                'name' => '鉄道業、道路旅客運送業、道路貨物運送業、水運業、航空運輸業、郵便業',
            ],
            [
                'name' => '倉庫業、運輸に附帯するサービス業',
            ],
            [
                'name' => '卸売業',
            ],
            [
                'name' => '小売業',
            ],
            [
                'name' => '金融業、保険業',
            ],
            [
                'name' => '不動産業',
            ],
            [
                'name' => '物品賃貸業',
            ],
            [
                'name' => '宿泊業',
            ],
            [
                'name' => '飲食店',
            ],
            [
                'name' => '持ち帰り・配達飲食サービス業',
            ],
            [
                'name' => '教育、学習支援',
            ],
            [
                'name' => '医療、福祉',
            ],
            [
                'name' => '複合サービス業',
            ],
            [
                'name' => '経営コンサルタント業、純粋持株会社',
            ],
            [
                'name' => '広告業',
            ],
            [
                'name' => '学術研究、専門・技術サービス業（経営コンサルタント業、純粋持株会社、広告業は除く）',
            ],
            [
                'name' => '生活関連サービス業、娯楽業',
            ],
            [
                'name' => 'その他のサービス業',
            ],
        ]);
    }
}
